jgroman/psoc_talking_clock/Generated_Source/PSoC4/VDAC_UAB_regs.h
/*SUBSAMPLE_CTRL*/
#define VDAC_UAB_SUBSAMPLE_SHIFT              CyUAB_SUBSAMPLE_SHIFT
#define VDAC_UAB_SUBSAMPLE_MASK               (0xffUL<<VDAC_UAB_SUBSAMPLE_SHIFT)

#define VDAC_UAB_SUBSAMPLE_INIT_SHIFT         CyUAB_SUBSAMPLE_INIT_SHIFT
#define VDAC_UAB_SUBSAMPLE_INIT_MASK          (0xffUL<<VDAC_UAB_SUBSAMPLE_INIT_SHIFT)


/*SW_STATIC*/
#define VDAC_UAB_SW_G0_SHIFT                  CyUAB_SW_G0_SHIFT
#define VDAC_UAB_SW_G0_MASK                   (1UL<<VDAC_UAB_SW_G0_SHIFT)

#define VDAC_UAB_SW_G1_SHIFT                  CyUAB_SW_G1_SHIFT
#define VDAC_UAB_SW_G1_MASK                   (1UL<<VDAC_UAB_SW_G1_SHIFT)

#define VDAC_UAB_SW_G2_SHIFT                  CyUAB_SW_G2_SHIFT
#define VDAC_UAB_SW_G2_MASK                   (1UL<<VDAC_UAB_SW_G2_SHIFT)

#define VDAC_UAB_SW_G3_SHIFT                  CyUAB_SW_G3_SHIFT
#define VDAC_UAB_SW_G3_MASK                   (1UL<<VDAC_UAB_SW_G3_SHIFT)

#define VDAC_UAB_SW_RG_SHIFT                  CyUAB_SW_RG_SHIFT
#define VDAC_UAB_SW_RG_MASK                   (1UL<<VDAC_UAB_SW_RG_SHIFT)

#define VDAC_UAB_SW_GG_SHIFT                  CyUAB_SW_GG_SHIFT
#define VDAC_UAB_SW_GG_MASK                   (1UL<<VDAC_UAB_SW_GG_SHIFT)

#define VDAC_UAB_SW_RT_SHIFT                  CyUAB_SW_RT_SHIFT
#define VDAC_UAB_SW_RT_MASK                   (1UL<<VDAC_UAB_SW_RT_SHIFT)

#define VDAC_UAB_SW_GT_SHIFT                  CyUAB_SW_GT_SHIFT
#define VDAC_UAB_SW_GT_MASK                   (1UL<<VDAC_UAB_SW_GT_SHIFT)

#define VDAC_UAB_SW_QT_SHIFT                  CyUAB_SW_QT_SHIFT
#define VDAC_UAB_SW_QT_MASK                   (1UL<<VDAC_UAB_SW_QT_SHIFT)

#define VDAC_UAB_EARLY_PS_SHIFT               CyUAB_EARLY_PS_SHIFT
#define VDAC_UAB_EARLY_PS_MASK                (1UL<<VDAC_UAB_EARLY_PS_SHIFT)

#define VDAC_UAB_EARLY_PO_SHIFT               CyUAB_EARLY_PO_SHIFT
#define VDAC_UAB_EARLY_PO_MASK                (1UL<<VDAC_UAB_EARLY_PO_SHIFT)

#define VDAC_UAB_STRB_RST_SEL_SHIFT           CyUAB_STRB_RST_SEL_SHIFT
#define VDAC_UAB_STRB_RST_SEL_MASK            (0x1fUL<<VDAC_UAB_STRB_RST_SEL_SHIFT)

#define VDAC_UAB_STRB_RST_EN_SHIFT            CyUAB_STRB_RST_EN_SHIFT
#define VDAC_UAB_STRB_RST_EN_MASK             (1UL<<VDAC_UAB_STRB_RST_EN_SHIFT)


/*SW_MODBIT_SRC*/
#define VDAC_UAB_MODBIT0_SRC_SEL_SHIFT        CyUAB_MODBIT0_SRC_SEL_SHIFT
#define VDAC_UAB_MODBIT0_SRC_SEL_MASK         (0x1fUL<<VDAC_UAB_MODBIT0_SRC_SEL_SHIFT)

#define VDAC_UAB_MODBIT1_SRC_SEL_SHIFT        CyUAB_MODBIT1_SRC_SEL_SHIFT
#define VDAC_UAB_MODBIT1_SRC_SEL_MASK         (0x1fUL<<VDAC_UAB_MODBIT1_SRC_SEL_SHIFT)


/*SW_CA_IN0*/
#define VDAC_UAB_SW_A0_MODBIT_SHIFT           CyUAB_SW_A0_MODBIT_SHIFT
#define VDAC_UAB_SW_A0_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_A0_MODBIT_SHIFT)

#define VDAC_UAB_SW_A1_MODBIT_SHIFT           CyUAB_SW_A1_MODBIT_SHIFT
#define VDAC_UAB_SW_A1_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_A1_MODBIT_SHIFT)

#define VDAC_UAB_SW_A2_MODBIT_SHIFT           CyUAB_SW_A2_MODBIT_SHIFT
#define VDAC_UAB_SW_A2_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_A2_MODBIT_SHIFT)

#define VDAC_UAB_SW_A3_MODBIT_SHIFT           CyUAB_SW_A3_MODBIT_SHIFT
#define VDAC_UAB_SW_A3_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_A3_MODBIT_SHIFT)

#define VDAC_UAB_SW_AP_SHIFT                  CyUAB_SW_AP_SHIFT
#define VDAC_UAB_SW_AP_MASK                   (0xfUL<<VDAC_UAB_SW_AP_SHIFT)

#define VDAC_UAB_SW_AQ_SHIFT                  CyUAB_SW_AQ_SHIFT
#define VDAC_UAB_SW_AQ_MASK                   (0xfUL<<VDAC_UAB_SW_AQ_SHIFT)

/*SW_CA_IN1*/    
#define VDAC_UAB_SW_AA_SHIFT                  CyUAB_SW_AA_SHIFT
#define VDAC_UAB_SW_AA_MASK                   (0xfUL<<VDAC_UAB_SW_AA_SHIFT)

#define VDAC_UAB_SW_AR_MODBIT_SHIFT           CyUAB_SW_AR_MODBIT_SHIFT
#define VDAC_UAB_SW_AR_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_AR_MODBIT_SHIFT)

#define VDAC_UAB_SW_AG_MODBIT_SHIFT           CyUAB_SW_AG_MODBIT_SHIFT
#define VDAC_UAB_SW_AG_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_AG_MODBIT_SHIFT)

#define VDAC_UAB_SW_AV_MODBIT_SHIFT           CyUAB_SW_AV_MODBIT_SHIFT
#define VDAC_UAB_SW_AV_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_AV_MODBIT_SHIFT)


/*SW_CA_TOP*/
#define VDAC_UAB_SW_RA_MODBIT_SHIFT           CyUAB_SW_RA_MODBIT_SHIFT
#define VDAC_UAB_SW_RA_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_RA_MODBIT_SHIFT)

#define VDAC_UAB_SW_GA_MODBIT_SHIFT           CyUAB_SW_GA_MODBIT_SHIFT
#define VDAC_UAB_SW_GA_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_GA_MODBIT_SHIFT)

#define VDAC_UAB_SW_VA_MODBIT_SHIFT           CyUAB_SW_VA_MODBIT_SHIFT
#define VDAC_UAB_SW_VA_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_VA_MODBIT_SHIFT)

#define VDAC_UAB_SW_SA_SHIFT                  CyUAB_SW_SA_SHIFT
#define VDAC_UAB_SW_SA_MASK                   (0xfUL<<VDAC_UAB_SW_SA_SHIFT)


/*SW_CB_IN0*/
#define VDAC_UAB_SW_B0_MODBIT_SHIFT           CyUAB_SW_B0_MODBIT_SHIFT
#define VDAC_UAB_SW_B0_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_B0_MODBIT_SHIFT)

#define VDAC_UAB_SW_B1_MODBIT_SHIFT           CyUAB_SW_B1_MODBIT_SHIFT
#define VDAC_UAB_SW_B1_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_B1_MODBIT_SHIFT)

#define VDAC_UAB_SW_B2_MODBIT_SHIFT           CyUAB_SW_B2_MODBIT_SHIFT
#define VDAC_UAB_SW_B2_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_B2_MODBIT_SHIFT)

#define VDAC_UAB_SW_B3_MODBIT_SHIFT           CyUAB_SW_B3_MODBIT_SHIFT
#define VDAC_UAB_SW_B3_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_B3_MODBIT_SHIFT)

#define VDAC_UAB_SW_BP_SHIFT                  CyUAB_SW_BP_SHIFT
#define VDAC_UAB_SW_BP_MASK                   (0xfUL<<VDAC_UAB_SW_BP_SHIFT)

#define VDAC_UAB_SW_BQ_SHIFT                  CyUAB_SW_BQ_SHIFT
#define VDAC_UAB_SW_BQ_MASK                   (0xfUL<<VDAC_UAB_SW_BQ_SHIFT)


/*SW_CB_IN1*/
#define VDAC_UAB_SW_BB_SHIFT                  CyUAB_SW_BB_SHIFT
#define VDAC_UAB_SW_BB_MASK                   (0xfUL<<VDAC_UAB_SW_BB_SHIFT)

#define VDAC_UAB_SW_BR_MODBIT_SHIFT           CyUAB_SW_BR_MODBIT_SHIFT
#define VDAC_UAB_SW_BR_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_BR_MODBIT_SHIFT)

#define VDAC_UAB_SW_BG_MODBIT_SHIFT           CyUAB_SW_BG_MODBIT_SHIFT
#define VDAC_UAB_SW_BG_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_BG_MODBIT_SHIFT)

#define VDAC_UAB_SW_BV_MODBIT_SHIFT           CyUAB_SW_BV_MODBIT_SHIFT
#define VDAC_UAB_SW_BV_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_BV_MODBIT_SHIFT)


/*SW_CB_TOP*/
#define VDAC_UAB_SW_RB_MODBIT_SHIFT           CyUAB_SW_RB_MODBIT_SHIFT
#define VDAC_UAB_SW_RB_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_RB_MODBIT_SHIFT)

#define VDAC_UAB_SW_GB_MODBIT_SHIFT           CyUAB_SW_GB_MODBIT_SHIFT
#define VDAC_UAB_SW_GB_MODBIT_MASK            (0xfUL<<VDAC_UAB_SW_GB_MODBIT_SHIFT)

